quick_test.yml
execution:
- concurrency: 2
  ramp-up: 5s
  hold-for: 5s
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - http://blazedemo.com

reporting:
- module: passfail
  criteria:
  - fail>0
- module: junit-xml
  filename: report.xml
  data-source: pass-fail
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: false  # display average times and percentiles
  summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: false  # provides test duration
  dump-xml: dump.xml
  dump-csv: dump.csv
- module: blazemeter

modules:
  console:
    # disable console reporter
    disable: true